Arithmetic Operation

In [6]:
import pandas as pd

var = pd.DataFrame({"A":[1,2,3,4], "B":[5,6,7,8]})

var["C"]=var["A"]+var["B"]

var

   A  B   C
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12

In [5]:
import pandas as pd

var = pd.DataFrame({"A":[1,2,3,4], "B":[5,6,7,8]})

var["C"]=var["A"]-var["B"]
var

   A  B  C
0  1  5 -4
1  2  6 -4
2  3  7 -4
3  4  8 -4

In [7]:
import pandas as pd

var = pd.DataFrame({"A":[1,2,3,4], "B":[5,6,7,8]})

var["C"]=var["A"]*var["B"]
var

   A  B   C
0  1  5   5
1  2  6  12
2  3  7  21
3  4  8  32

In [8]:
import pandas as pd

var = pd.DataFrame({"A":[1,2,3,4], "B":[5,6,7,8]})

var["C"]=var["A"]/var["B"]
var

   A  B         C
0  1  5  0.200000
1  2  6  0.333333
2  3  7  0.428571
3  4  8  0.500000

In [9]:
import pandas as pd

var1 = pd.DataFrame({"A":[10,12,13,14], "B":[15,16,17,18]})

var1

    A   B
0  10  15
1  12  16
2  13  17
3  14  18

In [10]:
var1["Python"] = var1["A"] <=20
var1

    A   B  Python
0  10  15    True
1  12  16    True
2  13  17    True
3  14  18    True

In [1]:
import pandas as pd

data_list = {
    "Roll_No": list(range(1, 21)),
    "Name": [
        "Pranjal", "Awdhut", "Shourya", "Dhruva", "Tanaya", "Aditi", "Addya", "Smruti", "Yash", "Ayushi",
        "Rohan", "Neha", "Kunal", "Pooja", "Aman", "Isha", "Sanket", "Meera", "Nikhil", "Kavya"
    ],
    "Age": [20, 21, 20, 19, 20, 21, 19, 20, 21, 20, 22, 20, 21, 19, 20, 21, 22, 20, 21, 19],
    "Marks": [85, 78, 90, 88, 76, 92, 81, 74, 89, 95, 82, 87, 79, 91, 73, 88, 84, 90, 77, 86],
    "Location": [
        "Pune", "Mumbai", "Delhi", "Nashik", "Nagpur", "Pune", "Mumbai", "Delhi", "Nashik", "Nagpur",
        "Pune", "Mumbai", "Delhi", "Nashik", "Nagpur", "Pune", "Mumbai", "Delhi", "Nashik", "Nagpur"
    ]
}

df_list = pd.DataFrame(data_list)

print(df_list)

    Roll_No     Name  Age  Marks Location
0         1  Pranjal   20     85     Pune
1         2   Awdhut   21     78   Mumbai
2         3  Shourya   20     90    Delhi
3         4   Dhruva   19     88   Nashik
4         5   Tanaya   20     76   Nagpur
5         6    Aditi   21     92     Pune
6         7    Addya   19     81   Mumbai
7         8   Smruti   20     74    Delhi
8         9     Yash   21     89   Nashik
9        10   Ayushi   20     95   Nagpur
10       11    Rohan   22     82     Pune
11       12     Neha   20     87   Mumbai
12       13    Kunal   21     79    Delhi
13       14    Pooja   19     91   Nashik
14       15     Aman   20     73   Nagpur
15       16     Isha   21     88     Pune
16       17   Sanket   22     84   Mumbai
17       18    Meera   20     90    Delhi
18       19   Nikhil   21     77   Nashik
19       20    Kavya   19     86   Nagpur

In [3]:
df_list.head() #first 5 rows

   Roll_No     Name  Age  Marks Location
0        1  Pranjal   20     85     Pune
1        2   Awdhut   21     78   Mumbai
2        3  Shourya   20     90    Delhi
3        4   Dhruva   19     88   Nashik
4        5   Tanaya   20     76   Nagpur

In [4]:
df_list.tail() #last 5 rows

    Roll_No    Name  Age  Marks Location
15       16    Isha   21     88     Pune
16       17  Sanket   22     84   Mumbai
17       18   Meera   20     90    Delhi
18       19  Nikhil   21     77   Nashik
19       20   Kavya   19     86   Nagpur

In [6]:
df_list.info()      # shows column names and data types

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Roll_No   20 non-null     int64
 1   Name      20 non-null     object
 2   Age       20 non-null     int64
 3   Marks     20 non-null     int64
 4   Location  20 non-null     object
dtypes: int64(3), object(2)
memory usage: 932.0+ bytes

In [7]:
df_list.describe()  # statistical summary (for numeric columns)

        Roll_No        Age      Marks
count  20.00000  20.000000  20.000000
mean   10.50000  20.300000  84.250000
std     5.91608   0.923381   6.422616
min     1.00000  19.000000  73.000000
25%     5.75000  20.000000  78.750000
50%    10.50000  20.000000  85.500000
75%    15.25000  21.000000  89.250000
max    20.00000  22.000000  95.000000

In [9]:
print("Mean:", df_list["Marks"].mean())
print("Median:", df_list["Marks"].median())
print("Mode:\n", df_list["Marks"].mode())
print("Sum:", df_list["Marks"].sum())
print("Minimum:", df_list["Marks"].min())
print("Maximum:", df_list["Marks"].max())
print("Standard Deviation:", df_list["Marks"].std())

Mean: 84.25
Median: 85.5
Mode:
 0    88
1    90
Name: Marks, dtype: int64
Sum: 1685
Minimum: 73
Maximum: 95
Standard Deviation: 6.422616289332565

In [10]:
print("Mean:", df_list["Age"].mean())
print("Median:", df_list["Age"].median())
print("Mode:\n", df_list["Age"].mode())
print("Sum:", df_list["Age"].sum())
print("Minimum:", df_list["Age"].min())
print("Maximum:", df_list["Age"].max())
print("Standard Deviation:", df_list["Age"].std())

Mean: 20.3
Median: 20.0
Mode:
 0    20
Name: Age, dtype: int64
Sum: 406
Minimum: 19
Maximum: 22
Standard Deviation: 0.9233805168766386